label ending:
    jump ending1

label ending1:
scene bg black
with dissolve

Me "あれから数週間後、いつもの平穏な日々が続いた。"

# 背景：電車
scene bg train day
with dissolve

Me "毎朝学校に向かう電車は憂鬱でしょうがない"
Me "こんな時に朝一緒に登校する人がいたらなぁとよく思う"
Me "電車に揺られながらただただ景色を眺めるだけの日々"

# 背景：図書館
scene bg library evening
with dissolve

Me "人は来ないし、もう一人の当番とも特に話すことなんてなかったし"
Me "図書委員の当番はただ暇なだけの時間だった"
Me "自分が委員会の当番の時はため息が出ていた日々"

# 背景：海
scene bg sea
with dissolve

Me "手伝いとはいえ、海に行けたのはいい思い出だった"
Me "だけど、これを共に思える人がいないと思うとただただ悲しい"
Me "数少ない夏の思い出もむなしく思えてくる日々"

# 背景：校庭
scene bg school ground
with dissolve

Me "授業中、窓から見える校庭"
Me "いやいやだったし、戦犯をかましただけの体育大会"
Me "校庭を見るだけで脳裏に浮かび上がる思い出したくもない日々"

# 背景：駅
scene bg station
with dissolve

Me """今日も駅前は人で込み合ってる
そういえばあそこの木はクリスマスの日に装飾されてたっけ
自分にもクリスマスぐらい共に過ごす彼女ぐらいほしかったっといってももう遅い日々"""

# 背景：ひとつづつ変えて
Me "朝起きて、学校に行って、勉強して、ご飯を食べて、家に帰って、遊んで、寝る。" ### <===どうする

Me "特に変わりのない当たり前な日々"

# 背景：今までの使ってきた背景
Me "これといった刺激もなく、これといった絶望も喜びもない。"
Me "いたって普通で平常で通常で庸常で尋常で一般的なでありふれた日々"
Me "高校二年生として、学校生活を謳歌したとは到底言えない思い出たち"
Me "あまりにも薄く、あまりにも浅く、あまりにも細く、あまりにも少なく、あまりにも乏しく、あまりにも貧しい日々"
Me "何かに没頭したことも何かを頑張ったことも"
Me "誰かを思ったことも誰かに思われたことも"
# 背景：黒
scene bg black

Me "”なかった”"
Me "何もなかった、誰もいなかった"
Me "何もない日々"
Me "俺の心は、"
Me "絶無が皆無が零が虚無が空虚ががらんどうがすっからかんが無意味が無意義が空白が..."
Me "支配していた"
Me "どうしてこんなに空っぽなんだっけ"

# 登場：Leap(顔を黒く隠して)


Me "何かを忘れているような気がする"
Me "何かをやってない気がする"
Me "何かを...何かを..."
Me "誰かを..."
Me "誰かを忘れているような気がする"
Me "...思い出せない"
Me "なんだったっけ？誰だったっけ？"
Me "思い出したい、思い出せない、思い出したい、思い出せない、思い出したい、思い出せない、思い出したい、思い出せない"
Me "..."
Me "........"
Me "何だったんだっけ"

# 退場：Leap(フェードアウトしていく感じでならなお良い)


Me "..."
Me "................."
Me "俺は今何を考えてたんだっけ"
Me "何か大切な...事..."
Me "だったはず...だったんだけど"
Me "思い出せないや"
Me "思い出せないってことは大切じゃないってことか"
Me "きっとそうだ、そうに違いない..."
Me "..."

"""
人は忘れていく生き物だ

人は新しいことを覚えたときそれと同時に本人の覚えていた何かをその場に置いていってしまう

それはどうしようもない事だ

人間の摂理であり、人間の神秘であり、人間の絶対の理でもある。

抗うことはできない。

そして、忘れる物は選べない

それは、どうでもいい物も然り、楽しい物も然り、悲しい物も然り、嬉しい物も辛い物も然り、

なにより、大切な物も然り

人間はいつの日か、

家族や友人や恋人との思い出

大切にしていたおもちゃや本、文房具といった物

おいしかった料理、好きな音楽、実家のにおい

そして、学校で学んだ事

そういったものを忘れていく

形を忘れ、色を忘れ、声を忘れ、味を忘れ、音を忘れ、香りを忘れ

それと同時、また新しく

形を覚え、色を覚え、声を覚え、味を覚え、音を覚え、香りを覚え

新たな知識を得る。

それは当たり前の事、ごく普通の人類万人に当てはまる事。
"""

#登場：Leap
show leap normal at leapPos

"""
ただそれが、神のいたずらによって女体化したに過ぎないのだ

英単語を覚えそして忘れる事は人間の本質と何ら変わりのない

ただ、あなたが忘れてしまっただけなのだ

ただ、あなたが英語頑張りたいと思わなくなってしまっただけだ

ただ、あなたが思い出せなくなっただけなのだ

...

..........

もし、あなたが英単語をたくさん覚えることを望むなら

それはきっと難しいだろう

なぜなら

英単語を一生覚えている事ができる人がいるとするならば

それは、

頑張ろうという強い意志がある者でも死ぬほど頑張る者でもない

それは、『英語』を楽しんでいる者だから

覚えることを楽しむ、学ぶことを楽しむ、

『英語』のすべてが”遊び”

日がな丸一日を『英語』の中にでき、それを苦と思わない

努力するものが楽しむものに勝てるわけがない

...もっともこれを見ているあなたがこっち側に来る勇気があるならば話は別なのだが
"""

$ badEndCode = 7
jump badEnd_call